justinh-rahb/DragonWheeze/sdkconfig.defaults
# DragonWheeze default sdkconfig — ESP32-C3 Super Mini (4MB flash)
CONFIG_IDF_TARGET="esp32c3"

# Flash / partitions
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# FreeRTOS 1000Hz tick rate (1ms precision for optocoupler pulse timing)
CONFIG_FREERTOS_HZ=1000

# Task watchdog on
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# OTA rollback
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# TLS options for MQTT
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
